Revit 2026 API

# ViewSheetDeleteViewport Method

---

Removes a viewport from the sheet by deleting it from the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void DeleteViewport(
	Viewport viewport
)
```
```vb
Public Sub DeleteViewport (
	viewport As Viewport
)
```
```cpp
public:
void DeleteViewport(
	Viewport^ viewport
)
```
```fsharp
member DeleteViewport :
        viewport : Viewport -> unit
```

#### Parameters

viewport Viewport
     The viewport that will be deleted and removed from the sheet.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ViewSheet Class

Autodesk.Revit.DB Namespace